{
    "pages":[
        {
            "projectNumber": 1,
            "projectImage": "app_center",
            "projectName": "Quantum App Center",
            "role": "UX Designer and Developer",
            "date": "November 2019 - Present",
            "overview": "The Quantum App Center is a centralized internal application hub, home to every application the Quantum team at T-Mobile has developed. This application was created in order to consolidate and simplify the app building and sharing process and create a unified visual language across the team's variety of projects.",
            "sections": {
                "Background": {
                    "0": "Upon first joining T-Mobile, one of the first things I noticed was how decentralized the internal tools were, particularly those developed by the data analytics team I was joining. As a team primarily servicing other internal T-Mobile teams, the Quantum team developed a variety of analytics tools for many different customers, often with overlapping users between mutliple apps. Despite this, each app was hosted on its own internal domain name, often with its own design language and no clear consistency between any of them.",
                    "1": "I worked directly with my manager on a proposal for the first version of the Quantum App Center, iterating over several designs until we both were satisfied with the end product. I presented the project proposal to our department director, who was so inspired by the presentation that he immediately approved moving forward with development of it. As an (at the time) passion project, myself and two other developers worked on the creation of this application in between other projects, demonstrating our drive and belief in the viability of what we were making."
                },
                "Understanding the Problem": {
                    "0": "Before presenting the project to my director, it was important that I fully understood and communicated why such a project was necessary in the first place. During my proposal, I explained that having a unified design language for our team's products would not only result in reduced development times (by reutilizing aspects of past projects for future ones), but would also have a net positive on user interaction and retention from one app to the next (and thereby reducing the amount of time that needed to be spent on training them on how to use the tool). These became the primary goals in designing the App Center."
                },
                "Early Design": {
                    "image1": "app_center_initial"
                },

                "First Redesign": {
                    "0": "After being in use for a couple of years, I decided it was time to freshen up the design and theme of the App Center to further hone in on a unified design style. The goal with the redesign was first to further simplify the design language. One of the shortcomings of the previous design was that the icons for apps became less readable as they were scaled down. As part of the redesign, I completely reworked the entire iconography suite to use a more stylish, flat design theme that also better incorporated T-Mobile's iconic magenta color.",
                    "image1": "app_center_version2"
                },

                "Iconography": {
                    "1": "In addition to improving the iconography, another goal was to shift the landing page of the App Center slightly to become more of a hub for the team in general, rather than just for the applications. This meant introducing a new carousel, which could be used to easily and effectively communicate new content and team updates to anyone using the app at a glance.",
                    "image2": "app_center_icons"
                },

                "Second Redesign": {
                    "2": "After reviewing and applying feedback from many team members, finally I landed on the design still in use on the App Center to this day. While The application is always being iterated upon (such as new content management features and content curation), the App Center provided me a great opportunity to really drive the design and development of a project from start to finish and serve the needs of 1000s of internal users.",
                    "image3": "app_center_current"
                },

                "Looking Forward": {
                    "0": "As the team continues to push forward, the needs of our customers are ever changing. In recent months, there has been a greater push to ensure content on the App Center's carousel is as fresh as possible, so the development team and I have continued to do what we can to iterate on the App Center's design and improve it in ways that will make it easier to change this content without having to deploy new code. The content management page, which as of August 2023 is finalizing production, was my solution to this problem, which should enable developers to communicate their updates much more quickly and efficiently moving forward.",
                    "image1": "app_center_manager"
                }
            }
        },
        {
            "projectNumber": 2,
            "projectImage": "branding",
            "projectName": "Quantum Branding",
            "role": "UX Designer and Graphic Designer",
            "date": "July 2017 - Present",
            "overview": "As the sole designer among a team of developers, I was tasked with defining the branding guidelines and visual language that would define the internal 'Quantum' brand within T-Mobile. This included designing a team logo, drafting a branding bible, standardizing our presentation tools, iconography, and more.",
            "sections": {
                "Background": {
                    "0": "Quantum is an internal data analytics team within the Engineering department at T-Mobile. As a team that primarily produces tools for other T-Mobile engineers and associated partners, the team operates more like a small start-up company than it does like a large corporation. As such, it became clear that the manner in which the team was presenting itself to others was slowly becoming insufficient; without a clear team identity, it was difficult for us to stand out to our partners against competition from other internal teams when vying for buy-ins on potential projects. As the team's sole designer, I set out to define not only my team's visual identity, but provide guidelines for how my teammates should communicate outside of the team and what our products should be developed to look like.",
                    "image1": "branding_blueprint"
                },
                "Logo Work": {
                    "0": "One of the first challenges I faced was crafting a logo for the Quantum team. The Quantum logo needed to be simple but recognizable, have meaning while being abstract, and be able to reasonably stand alongside the very recognizable T-Mobile logo on internal documents. I quickly landed on the idea of using the hexagon shape as my starting point due to the recurring appearance of the shape within our work (primarily as 'hexbins'). I wanted to incorporate the already existing Quantum brand name into the logo in some way, and decided to do so by shaping the hexagon into a Q formation. From there it was a matter of experimenting and polling teammates on what they did and didn't like about each version, before ultimately settling on the final design seen below. The Quantum logo as it exists now represents the team's evolutionary approach to software development, with each color grade representing growth. The gap in the Q logo seen in the Standard and Simple designs signifies that there will always be room for growth and improvement, even on 'completed' projects. Thanks to the simplicity of the logo, over time many iterations of the logo have been created to celebrate different events or projects, such as those seen in the original image at the top of the page.",
                    "image1": "branding_logo_iterations"
                },

                "Iconography": {
                    "0": "As part of my push towards a unified branding language, I developed a style for icons to be used as both application logos and within presentations. Utilizing a simple, flat design, each icon uses the same 5 colors (white, light pink, magenta, maroon, and opaque) to communicate some aspect of an application's functionality or common concepts talked about in presentations. These icons needed to not only represent their paired application, but be viewable at a variety of sizes while still being recognizable. In order to ensure any given application became recognizable internally as belonging to the Quantum team, the same style and color scheme was applied to each one, further cementing our brand's awareness within the company.",
                    "image1": "branding_icons"
                },

                "Communication": {
                    "0": "Outside of graphic design, the team was also sorely in need of standardized ways of communicating outside of our organization. I created templates, both PowerPoint and Email based, for the team to use to ensure our communication remained consistent in look and feel. Both templates are now used regularly by everyone within the organization, becoming the de facto standard.",
                    "image1": "branding_docs"
                },

                "Style Guide": {
                    "0": "In order to future-proof the team in case I ever leave, or if additional designers are ever brought on in addition to me, I created an extensive branding bible to explain how things should look and feel when designed within the Quantum team, as well as the rationale for each of those choices. This document goes into extensive detail on the does and don'ts of web development within the team, ensuring that nobody-- designer or developer-- has any questions on whether their product is in compliance or not.",
                    "image1": "branding_style_guide"
                },

                "Key Takeaways": {
                    "0": "Designing and evolving the Quantum brand over a 5 year span has been an extremely rewarding and enriching experience for me. Working on it helped me to better understand not only how I can better communicate and deliver useful graphics to non-designers, but also gave me greater insight into how to create simple and effective iconography. My toolset has expanded greatly thanks to this ongoing effort.",
                    "gif1": "branding_spinner"
                }
            }
        },
        {
            "projectNumber": 3,
            "projectImage": "app_center",
            "projectName": "Customer Insights",
            "role": "UX Designer",
            "date": "January 2021 - Present",
            "overview": "Customer Insights is an internal troubleshooting tool within T-Mobile that helps developers deep-dive into a customer's data to hone in on why that customer may be having a suboptimal networking experience. The development of this tool includes both a stable web version, as well as an experimental mobile version, which was eventually reincorporated back into the main experience.",
            "sections": {
                "Background": {
                    "0": "The Quantum team at T-Mobile predominantly works with data analytics, but especially data focused on customer experience with the T-Mobile network. The team saw an opportunity to try and improve engineers' troubleshooting experience to aid in sussing out what could be causing a customer's experience on the network to be suboptimal. What started as a proof of concept, hackathon-style project quickly ballooned up to become the team's most used analytics tool, with 1000s of users across engineering, finance, and executive teams. As the team's sole designer, I drove the design and development of this application from conceptualization through multiple iterations over the last few years, including a mobile port."
                },
                
                "Early Iterations": {
                    "0": "Early on in the project, the team was still finalizing what exactly the application would and wouldn't be capable of. During this time, I created a variety of wireframes to get a better idea of how the various app features would be laid out and interact with each other. These documents proved very valuable during early ideation on finalizing what our initial release target would entail.",
                    "image1": "customer_insights_wireframe"
                },

                "Prototype": {
                    "0": "After the final functionality was decided upon, I began creating more detailed designs to give the team inspiration and guideance. During this time, I created a series of prototypes, which were reviewed regularly with the development team as we continues to hone in on the final product as a team. After countless feedback sessions with both engineers and customers, we finally landed on a design and development began.",
                    "image1": "customer_insights_prototype"
                },

                "Mobile Version": {
                    "0": "A couple of years after the intitial designs the team came together and, in an effort to branch out into a space we had not previously, determined that we were going to make a mobile version of Customer Insights, then called Frontline Advisor. This version of the application was to be created in a bid to break out from being an exclusively internal-only development team and create a tool to be used by front-facing employees in T-Mobile stores to directly help troubleshoot customer issues. While various re-orgs eventually killed the project, a fully functional mobile app was created with myself as its primary designer AND developer.",
                    "link1": "customer_insights_mobile_mockup",
                    "1": "Despite working for a telecom company, the Quantum team has very little experience with mobile app development, instead choosing to almost exclusively develope web apps. This, paired with T-Mobile's very strict mobile VPN policies, made mobile a very difficult space to break into within the company. Despite this, I led the development team in the creation of a React Native mobile app that would target primarily the iPads used in T-Mobile stores (but also work on Android tablets, just in case).",
                    "2": "Because this was not a formally approved project, the team and I went above and beyond in evangelizing management into approving of the project, going as far as creating a series of lifestyle images to aid in pitching the concept to higher-ups.",
                    "image1": "customer_insights_lifestyle"
                },

                "Redesign": {
                    "0": "Despite repeated approval of our mobile application, unrelated re-orgs disbanded the team we had partnered with in the creation of the mobile app, killing any chances of getting it into store employees' hands. While this was a bit of a blow to the team morale, we didn't want to let something such as this put our efforts to waste. There were a number of unique features and designs only present in the mobile version that we decided to bring back to the web version, effectively combining them back together. I created a series of mockups on a short turn-around to aid the team in quickly bringing the web version back up to parity with the mobile app.",
                    "link1": "customer_insights_redesign_mockup_v4"
                },

                "Key Takeaways": {
                    "0": "Working on Customer Insights on its various iterations taught me a lot about working agilely on a software development team. Our team was hungry to prove themselves, which often resulted in a design to turn things out on a very short timeframe. Despite being the only designer on the team, I made it my mission to not be the weak link in this competitive environment, keeping pace with several developers and supplying all of the needed wireframes, prototypes, mockups, iconography, and design audits needed on time while still maintaining my other work duties. While there were times where development of this project proved very stressful, it was overall a very rewarding experience, especially in hindsight, knowing that it has now become Quantum's most widely used tool by an order of magnitude. Our hard work on this project was regularly recognized within the org, netting the team more than one award from the directors."
                }
            }
        },
        {
            "projectNumber": 4,
            "projectImage": "qhelp",
            "projectName": "Q-Help",
            "role": "Software Developer",
            "date": "July 2021",
            "overview": "Q-Help is an internal JavaScript library used within T-Mobile and developed as a passion project.  Including the library in a project allows a developer to create an overlay on top of their web application that guides first-time users on how to operate it.",
            "sections": {
                "Background": {
                    "0": "As a hybrid designer and developer, I sometimes would take up projects as the primary developer for that project. Having a background in both design and development has helped me greatly in my field, as having a better understanding of what is and isn't feasible to develop has left me in a better position to keep my designs realistic and ensured communication with developers directly is productive. One such project that I took on in my spare time while at T-Mobile is Q-Help, a JavaScript library that overlays onto any app it's included in. Q-Help was developed using React to reduce compatibility issues, as most of the Quantum team's products were developed in that language. The tool, when added to an application, stores a cookie in the user's browser that detects whether they have viewed the app before. If it's their first time, the plugin will auto-play a tutorial overlaid on top of the application, pointing at each of the elements in question each step of the way and allowing users to move forwards and backwards through the explanations at their leisure. I developed this library to be extremely flexible and customizable; almost every facet of the tool can be customized, down to how long each bubble stays on the screen (the default scales with text length). A developer who wants to use this need only type out their tutorial and fill out the name of each element they want to point at, though-- it is extremely plug-and-play."
                },
                "Accessibility": {
                    "0": "I designed and developed Q-Help with accessibility in mind, which is why when I put it together, I made sure to include an extensive walkthrough on how to implement and utilize the tool for other developers to use. While Q-Help has been used by many of my T-Mobile collegues now, none of them have ever felt the need to reach out and ask me for help on using it, so the included documentation has proved very successful.",
                    "image1": "qhelp_readme"
                }
            }
        }
    ]
}